%%%%% 多維陣列

%%% 多維陣列的建立 

% Example 1

A = [1 0 2 5; 4 1 8 7; 3 2 6 3];
A(:, :, 2) = [3 5 4 1; 2 6 2 1; 4 2 3 0]

% Example 2

A=[1 0 2 5; 4 1 8 7; 3 2 6 3];
A(:, :, 2)=[3 5 4 1; 2 6 2 1; 4 2 3 0];
A(2, 1, 3)=5;
disp(A);

% Example 3

A=[1 0 2 5; 4 1 8 7; 3 2 6 3];
A(:, :, 2)=7;
disp(A);

% Example 4

A = [1 2; 3 4];
B = [1 0; 0 1];
Z = cat(1, A, B)	% 數字 1 表示將陣列 A 與 B 上下垂直並排

% Example 5

A = [1 2; 3 4];
B = [1 0; 0 1];
Z = cat(2, A, B)	% 數字 2 表示將陣列 A 與 B 左右水平並排 

% Example 6

A = [1 2; 3 4];
B = [1 0; 0 1];
Z = cat(3, A, B)	% 數字 3 表示將陣列 A 與 B 重疊排成三維陣

% Example 7

A = [1 2; 3 4];
B = [1 0; 0 1];
Z = cat(4, A, B)	% 數字 4 表示將陣列 A 與 B 放在相鄰的兩「箱」

% Example 8

A=rand(2,3,4)

%%% 多維陣列的數學運算

% Example 9

A = [1 1 1 1; 2 2 2 2; 3 3 3 3];
B = [0 0 0 0; 1 1 1 1; 1 2 3 4];
Z = cat(3, A, B);	% 將矩陣 A, B 疊成一個三維陣列
S = sum(Z, 1)		% 根據第一維度來對元素進行相加
size(S)

% Example 10

A = [1 1 1 1; 2 2 2 2; 3 3 3 3];
B = [0 0 0 0; 1 1 1 1; 1 2 3 4];
Z = cat(3, A, B);	% 將矩陣 A, B 疊成一個三維陣列
S = sum(Z, 2)		% 根據第二維度來對元素進行相加
size(S)

% Example 11

A = [1 1 1 1; 2 2 2 2; 3 3 3 3];
B = [0 0 0 0; 1 1 1 1; 1 2 3 4];
Z = cat(3, A, B);	% 將矩陣 A, B 疊成一個三維陣列
S = sum(Z, 3)		% 根據第三維度來對元素進行相加
size(S)

% Example 12

A = [1 1 1 1; 2 2 2 2; 3 3 3 3];
B = [0 0 0 0; 1 1 1 1; 1 2 3 4];
Z = cat(3, A, B);	% 將矩陣 A, B 疊成一個三維陣列
S = sum(sum(Z))
